In [1]:
pwd

'C:\\Users\\ahlswede\\Documents\\Fragmente'

In [2]:
cd \Users\ahlswede\Documents\Martina\Python

C:\Users\ahlswede\Documents\Martina\Python

In [8]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
#df = pd.read_csv('countries.csv')
df = pd.read_csv("https://raw.githubusercontent.com/edlich/eternalrepo/master/DS-WAHLFACH/countries.csv")

In [9]:
df

       Name     People     Area   BIP Currency
0   Germany   82521653   357385  3466      EUR
1     Japan  126045000   377835  4938      YEN
2    Canada   36503097  9984670  1529      CAD
3     Italy   60501718   301338  1850      EUR
4  Brazilia  208360000  8515770  1798     REAL

In [10]:
df.shape

(5, 5)

In [84]:
len(df)

5

In [83]:
df.columns

Index(['Name', 'People', 'Area', 'BIP', 'Currency'], dtype='object')

In [11]:
print(df.describe())

             People          Area         BIP
count  5.000000e+00  5.000000e+00     5.00000
mean   1.027863e+08  3.907400e+06  2716.20000
std    6.759970e+07  4.904957e+06  1457.86083
min    3.650310e+07  3.013380e+05  1529.00000
25%    6.050172e+07  3.573850e+05  1798.00000
50%    8.252165e+07  3.778350e+05  1850.00000
75%    1.260450e+08  8.515770e+06  3466.00000
max    2.083600e+08  9.984670e+06  4938.00000

In [12]:
df.tail(4)

       Name     People     Area   BIP Currency
1     Japan  126045000   377835  4938      YEN
2    Canada   36503097  9984670  1529      CAD
3     Italy   60501718   301338  1850      EUR
4  Brazilia  208360000  8515770  1798     REAL

In [18]:
df['Currency'].eq('EUR')

0     True
1    False
2    False
3     True
4    False
Name: Currency, dtype: bool

In [19]:
df[df['Currency'].eq('EUR')]

      Name    People    Area   BIP Currency
0  Germany  82521653  357385  3466      EUR
3    Italy  60501718  301338  1850      EUR

In [22]:
df2 = df.drop(['People', 'Area', 'BIP'], axis=1)
df2

       Name Currency
0   Germany      EUR
1     Japan      YEN
2    Canada      CAD
3     Italy      EUR
4  Brazilia     REAL

In [23]:
df[df['BIP'].gt(2000)]

      Name     People    Area   BIP Currency
0  Germany   82521653  357385  3466      EUR
1    Japan  126045000  377835  4938      YEN

In [32]:
df2 = df[df['People'].gt(50000000)]
df3 = df2[df2['People'].lt(150000000)]
df3

      Name     People    Area   BIP Currency
0  Germany   82521653  357385  3466      EUR
1    Japan  126045000  377835  4938      YEN
3    Italy   60501718  301338  1850      EUR

In [33]:
df.rename(index=str, columns={"BIP": "Bip"})

       Name     People     Area   Bip Currency
0   Germany   82521653   357385  3466      EUR
1     Japan  126045000   377835  4938      YEN
2    Canada   36503097  9984670  1529      CAD
3     Italy   60501718   301338  1850      EUR
4  Brazilia  208360000  8515770  1798     REAL

In [61]:
df["BIP"].sum()

13581

In [66]:
average = df["People"].sum()/len(df)
average

102786293.6

In [89]:
average = df["People"].mean()
average

102786293.6

In [90]:
df.sort_values("Name", ascending=True)

       Name     People     Area   BIP Currency
4  Brazilia  208360000  8515770  1798     REAL
2    Canada   36503097  9984670  1529      CAD
0   Germany   82521653   357385  3466      EUR
3     Italy   60501718   301338  1850      EUR
1     Japan  126045000   377835  4938      YEN

In [81]:
df4 = df[df['Area'].gt(1000000)]
df4

       Name     People     Area   BIP Currency
2    Canada   36503097  9984670  1529      CAD
4  Brazilia  208360000  8515770  1798     REAL

In [82]:
df5 = df[df['Area'].le(1000000)]
df5

      Name     People    Area   BIP Currency
0  Germany   82521653  357385  3466      EUR
1    Japan  126045000  377835  4938      YEN
3    Italy   60501718  301338  1850      EUR

In [86]:
df['Area'].gt(1000000)

0    False
1    False
2     True
3    False
4     True
Name: Area, dtype: bool

df["Area"].replace(df["Area"].le(1000000),"SMALL") # führt auch nicht zum Ziel, da True und False nicht ersetzt werden

In [91]:
df["Area"].where(df["Area"].gt(1000000), "BIG")

0        BIG
1        BIG
2    9984670
3        BIG
4    8515770
Name: Area, dtype: object

In [92]:
df["Area"].where(df["Area"].le(1000000), "SMALL")

0    357385
1    377835
2     SMALL
3    301338
4     SMALL
Name: Area, dtype: object

In [93]:
df6=df
df6["Area"] = df["Area"].where(df["Area"].le(1000000), "SMALL")
df6

       Name     People    Area   BIP Currency
0   Germany   82521653  357385  3466      EUR
1     Japan  126045000  377835  4938      YEN
2    Canada   36503097   SMALL  1529      CAD
3     Italy   60501718  301338  1850      EUR
4  Brazilia  208360000   SMALL  1798     REAL

df7=df
df7["Area"] = df["Area"].where(df["Area"].gt(1000000), "BIG") # liefert Fehler
print(df7)

Create a new data frame from the original where the area is changed as follows:
all countries with > 1.000.000 get BIG and <= 1.000.000 get SMALL in the cell replaced!

In [103]:
df = pd.read_csv("https://raw.githubusercontent.com/edlich/eternalrepo/master/DS-WAHLFACH/countries.csv")
df7 = df
df7["Area"] = np.where(df["Area"].gt(1000000), "BIG", "SMALL")
print(df7)

       Name     People   Area   BIP Currency
0   Germany   82521653  SMALL  3466      EUR
1     Japan  126045000  SMALL  4938      YEN
2    Canada   36503097    BIG  1529      CAD
3     Italy   60501718  SMALL  1850      EUR
4  Brazilia  208360000    BIG  1798     REAL